app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def signed_out
  # clear the authentication toke when the user manually signs out
  user = User.find_by_id(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."email" = 'dil@i.ua' LIMIT 1
SELECT 1 AS one FROM "users" WHERE ("users"."email" = 'dil@i.ua' AND "users"."id" != 1) LIMIT 1
---
  def set_account_info
    old_user = current_user

  # verify the current password by creating a new user record.
     @user = User.authenticate_by_username(old_user.username, params[:user][:password])

  # verify
   if @user.nil?
      @user = current_user
      @user.errors[:password] = "Password is incorrect."
      render :action => "account_settings"
    else
    # update the user with any new username and email
    @user.update(params[:user])
    # Set the old email and username, which is validated only if it has changed.
    @user.previous_email = old_user.email
    @user.previous_username = old_user.username

    if @user.valid?
      # If there is a new_password value, then we need to update the password.
      @user.password = @user.new_password unless @user.new_password.nil? || @user.new_password.empty?