app/controllers/users_controller.rb

 def create
      @user = User.new(params[:user])

    if @user.valid?
      @user.save
---
INSERT INTO "users" ("authentication_token", "created_at", "email", "password_hash", "password_salt", "roleid", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)